# Parameters
nc: 1  # Number of classes (you have only 'drone')
depth_multiple: 0.33  # Model depth multiple
width_multiple: 0.50  # Layer channel multiple

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Backbone
backbone:
  [[-1, 1, Conv, [1, 32, 6, 2, 2]],  # 0-P1/2 (For grayscale images, input channels = 1)
   [-1, 1, Conv, [32, 64, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [64, 64, 1]],  # 2
   [-1, 1, Conv, [64, 128, 3, 2]],  # 3-P3/8
   [-1, 3, BottleneckCSP, [128, 128, 1]],  # 4
   [-1, 1, Conv, [128, 256, 3, 2]],  # 5-P4/16
   [-1, 3, BottleneckCSP, [256, 256, 1]],  # 6
   [-1, 1, Conv, [256, 512, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [512, 512, [5, 9, 13]]],  # 8
   [-1, 3, BottleneckCSP, [512, 512, 1]],  # 9
  ]

# Head
head:
  [[-1, 1, Conv, [512, 256, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # 12
   [-1, 1, Conv, [512, 256, 1, 1]],  # 13
   [-1, 3, BottleneckCSP, [256, 256, 1]],  # 14
  ]
